/* c03ex06.rex */

call charout, "Entre seu nome: "
pull Nome

say "Ola, " Nome "! Bem-vindo ao estudo de REXX."

say
call charout, "Tecle <Enter> para encerrar... "
pull

exit
